HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDma_regdef.h
/** \\brief  DMA Channel Read Data CRC Register */
typedef struct _Ifx_DMA_CH_RDCRCR_Bits
{
    unsigned int RDCRC:32;                  /**< \brief [31:0] Read Data CRC (rwh) */
} Ifx_DMA_CH_RDCRCR_Bits;

/** \\brief  DMA Channel Source Address Register */
typedef struct _Ifx_DMA_CH_SADR_Bits
{
    unsigned int SADR:32;                   /**< \brief [31:0] Source Address (rwh) */
} Ifx_DMA_CH_SADR_Bits;

/** \\brief  DMA Channel Source and Destination Address CRC Register */
typedef struct _Ifx_DMA_CH_SDCRCR_Bits
{
    unsigned int SDCRC:32;                  /**< \brief [31:0] Source and Destination Address CRC (rwh) */
} Ifx_DMA_CH_SDCRCR_Bits;

/** \\brief  DMA Channel Shadow Address Register */
typedef struct _Ifx_DMA_CH_SHADR_Bits
{
    unsigned int SHADR:32;                  /**< \brief [31:0] Shadowed Address (rwh) */
} Ifx_DMA_CH_SHADR_Bits;

/** \\brief  DMA Clock Control Register */
typedef struct _Ifx_DMA_CLC_Bits
{
    unsigned int DISR:1;                    /**< \brief [0:0] Module Disable Request Bit (rw) */
    unsigned int DISS:1;                    /**< \brief [1:1] Module Disable Status Bit (rh) */
    unsigned int reserved_2:1;              /**< \brief \internal Reserved */
    unsigned int EDIS:1;                    /**< \brief [3:3] Sleep Mode Enable Control (rw) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_DMA_CLC_Bits;

/** \\brief  DMA Error Interrupt Set Register */
typedef struct _Ifx_DMA_ERRINTR_Bits
{
    unsigned int SIT:1;                     /**< \brief [0:0] Set Error Interrupt Service Request (w) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_DMA_ERRINTR_Bits;

/** \\brief  DMA Channel Hardware Resource Register */
typedef struct _Ifx_DMA_HRR_Bits
{
    unsigned int HRP:2;                     /**< \brief [1:0] Hardware Resource Partition y (rw) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_DMA_HRR_Bits;

/** \\brief  Module Identification Register */
typedef struct _Ifx_DMA_ID_Bits
{
    unsigned int MOD_REV:8;                 /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MOD_TYPE:8;                /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_DMA_ID_Bits;

/** \\brief  DMA Memory Control Register */
typedef struct _Ifx_DMA_MEMCON_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int INTERR:1;                  /**< \brief [2:2] Internal ECC Error (rwh) */
    unsigned int reserved_3:1;              /**< \brief \internal Reserved */
    unsigned int RMWERR:1;                  /**< \brief [4:4] Internal Read Modify Write Error (rwh) */
    unsigned int reserved_5:1;              /**< \brief \internal Reserved */
    unsigned int DATAERR:1;                 /**< \brief [6:6] SPB Data Phase ECC Error (rwh) */
    unsigned int reserved_7:1;              /**< \brief \internal Reserved */
    unsigned int PMIC:1;                    /**< \brief [8:8] Protection Bit for Memory Integrity Control Bit (w) */
    unsigned int ERRDIS:1;                  /**< \brief [9:9] ECC Error Disable (rw) */
    unsigned int reserved_10:22;            /**< \brief \internal Reserved */
} Ifx_DMA_MEMCON_Bits;

/** \\brief  DMA Mode Register */
typedef struct _Ifx_DMA_MODE_Bits
{
    unsigned int MODE:1;                    /**< \brief [0:0] Hardware Resource Supervisor Mode (rw) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_DMA_MODE_Bits;

/** \\brief  DMA OCDS Trigger Set Select */
typedef struct _Ifx_DMA_OTSS_Bits
{
    unsigned int TGS:4;                     /**< \brief [3:0] Trigger Set () for OTGB0/1 (rw) */
    unsigned int reserved_4:3;              /**< \brief \internal Reserved */
    unsigned int BS:1;                      /**< \brief [7:7] OTGB0/1 Bus Select (rw) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_DMA_OTSS_Bits;

/** \\brief  Pattern Read Register 0 */
typedef struct _Ifx_DMA_PRR0_Bits
{
    unsigned int PAT00:8;                   /**< \brief [7:0] Pattern for Move Engine (rw) */
    unsigned int PAT01:8;                   /**< \brief [15:8] Pattern for Move Engine (rw) */
    unsigned int PAT02:8;                   /**< \brief [23:16] Pattern for Move Engine (rw) */
    unsigned int PAT03:8;                   /**< \brief [31:24] Pattern for Move Engine (rw) */
} Ifx_DMA_PRR0_Bits;

/** \\brief  Pattern Read Register 1 */
typedef struct _Ifx_DMA_PRR1_Bits
{
    unsigned int PAT10:8;                   /**< \brief [7:0] Pattern for Move Engine (rw) */
    unsigned int PAT11:8;                   /**< \brief [15:8] Pattern for Move Engine (rw) */
    unsigned int PAT12:8;                   /**< \brief [23:16] Pattern for Move Engine (rw) */
    unsigned int PAT13:8;                   /**< \brief [31:24] Pattern for Move Engine (rw) */
} Ifx_DMA_PRR1_Bits;

/** \\brief  DMA Suspend Acknowledge Register */
typedef struct _Ifx_DMA_SUSACR_Bits
{
    unsigned int SUSAC:1;                   /**< \brief [0:0] Channel Suspend Mode or Frozen State Active for DMA Channel z (rh) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_DMA_SUSACR_Bits;

/** \\brief  DMA Suspend Enable Register */
typedef struct _Ifx_DMA_SUSENR_Bits
{
    unsigned int SUSEN:1;                   /**< \brief [0:0] Channel Suspend Enable for DMA Channel z (rw) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_DMA_SUSENR_Bits;

/** \\brief  Time Register */
typedef struct _Ifx_DMA_TIME_Bits
{
    unsigned int COUNT:32;                  /**< \brief [31:0] Timestamp Count (r) */
} Ifx_DMA_TIME_Bits;

/** \\brief  DMA Transaction State Register */
typedef struct _Ifx_DMA_TSR_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] DMA Channel Reset (rwh) */
    unsigned int HTRE:1;                    /**< \brief [1:1] Hardware Transaction Request Enable State (rh) */
    unsigned int TRL:1;                     /**< \brief [2:2] Transaction/Transfer Request Lost of DMA Channel (rh) */
    unsigned int CH:1;                      /**< \brief [3:3] Transaction Request State (rh) */
    unsigned int reserved_4:4;              /**< \brief \internal Reserved */
    unsigned int HLTREQ:1;                  /**< \brief [8:8] Halt Request (rwh) */
    unsigned int HLTACK:1;                  /**< \brief [9:9] Halt Acknowledge (rh) */
    unsigned int reserved_10:6;             /**< \brief \internal Reserved */
    unsigned int ECH:1;                     /**< \brief [16:16] Enable Hardware Transfer Request (w) */
    unsigned int DCH:1;                     /**< \brief [17:17] Disable Hardware Transfer Request (w) */
    unsigned int CTL:1;                     /**< \brief [18:18] Clear Transaction Request Lost for DMA Channel z (w) */
    unsigned int reserved_19:5;             /**< \brief \internal Reserved */
    unsigned int HLTCLR:1;                  /**< \brief [24:24] Clear Halt Request and Acknowledge (w) */
    unsigned int reserved_25:7;             /**< \brief \internal Reserved */
} Ifx_DMA_TSR_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Dma_union
 * \{  */

/** \\brief  DMA Hardware Resource 0 Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_ACCEN00_Bits B;
} Ifx_DMA_ACCEN00;

/** \\brief  DMA Hardware Resource 0 Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_ACCEN01_Bits B;
} Ifx_DMA_ACCEN01;

/** \\brief  DMA Hardware Resource 1 Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_ACCEN10_Bits B;
} Ifx_DMA_ACCEN10;

/** \\brief  DMA Hardware Resource 1 Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_ACCEN11_Bits B;
} Ifx_DMA_ACCEN11;

/** \\brief  DMA Hardware Resource 2 Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_ACCEN20_Bits B;
} Ifx_DMA_ACCEN20;

/** \\brief  DMA Hardware Resource 2 Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_ACCEN21_Bits B;
} Ifx_DMA_ACCEN21;

/** \\brief  DMA Hardware Resource 3 Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_ACCEN30_Bits B;
} Ifx_DMA_ACCEN30;

/** \\brief  DMA Hardware Resource 3 Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_ACCEN31_Bits B;
} Ifx_DMA_ACCEN31;

/** \\brief  DMA Clear Error Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_BLK_CLRE_Bits B;
} Ifx_DMA_BLK_CLRE;

/** \\brief  DMA Enable Error Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_BLK_EER_Bits B;
} Ifx_DMA_BLK_EER;

/** \\brief  DMA Error Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_BLK_ERRSR_Bits B;
} Ifx_DMA_BLK_ERRSR;

/** \\brief  DMA Move Engine Channel Address and Interrupt Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_BLK_ME_ADICR_Bits B;
} Ifx_DMA_BLK_ME_ADICR;

/** \\brief  DMA Move Engine Channel Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_BLK_ME_CHCR_Bits B;
} Ifx_DMA_BLK_ME_CHCR;

/** \\brief  DMA Move Engine Channel Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DMA_BLK_ME_CHSR_Bits B;
} Ifx_DMA_BLK_ME_CHSR;

